Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པས་སྟོང་།
en: Feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth].

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་སྟོང་།
en: The sense fields, the sensory elements, and the links of dependent origination are empty of the links of dependent origination [and so forth].

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་སྟོང་། འཕགས་པའི་བདེན་པ་དང་།
en: The perfections, all the aspects of emptiness, and the factors conducive to enlightenment are empty of the factors conducive to enlightenment [and so forth]. {

source: བསམ་གཏན་དང་།
en: Ki.

source: ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་ནི། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པས་སྟོང་། སྟོང་པ་ཉིད་དང་།
en: V: 28} The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, and the serial steps of meditative absorption are empty of the serial steps of meditative absorption [and so forth].

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ནི་གཟུངས་ཀྱི་སྒོས་སྟོང་།
en: Emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are empty of the dhāraṇī gateways [and so forth].

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ནི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པས་སྟོང་།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are empty of eighteen distinct qualities of the buddhas [and so forth]. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་སྟོང་སྟེ།
en: The goals], up to and including all-aspect omniscience, are empty of all-aspect omniscience [and so forth].

source: རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མཉམ་པ་ཉིད་དེ།
en: All these, Subhūti, constitute the sameness of bodhisattva great beings.

source: དེ་ལ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Abiding in it, bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་བས་པར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: Blessed Lord, when bodhisattva great beings undertake training in order that physical forms may be terminated, do they train in all-aspect omniscience?

source: གཟུགས་འདོད་ཆགས་དང་བྲལ་བར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: When they undertake training in order to become detached from physical forms, do they train in all-aspect omniscience?

source: གཟུགས་འགག་པར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: When they undertake training in order that physical forms may cease, do they train in all-aspect omniscience?

source: གཟུགས་མི་སྐྱེ་བར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: When they undertake training in order that physical forms may not arise, do they train in all-aspect omniscience?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བས་པར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: When they undertake training in order that feelings, perceptions, formative predispositions, and consciousness may be terminated, do they train in all-aspect omniscience?

source: རྣམ་པར་ཤེས་པ་འདོད་ཆགས་དང་བྲལ་བར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: When they undertake training in order to become detached from consciousness [and so forth], do they train in all-aspect omniscience?

source: རྣམ་པར་ཤེས་པ་འགག་པར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: When they undertake training in order that consciousness [and so forth] may cease, do they train in all-aspect omniscience?

source: རྣམ་པར་ཤེས་པ་མི་སྐྱེ་བར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ། སྐྱེ་མཆེད་དང་། ཁམས་དང་།
en: When they undertake training in order that consciousness [and so forth] may not arise, do they train in all-aspect omniscience?

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བས་པར་བགྱི་བ་དང་། འདོད་ཆགས་དང་བྲལ་བར་བགྱི་བ་དང་། འགག་པར་བགྱི་བ་དང་། མི་སྐྱེ་བར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: When they undertake training in order that the sense fields, the sensory elements, and the links of dependent origination may be terminated, in order to become detached from them, in order that they may cease, and in order that they may not arise, do they train in all-aspect omniscience?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་བཅྭོ་བརྒྱད་བས་པར་བགྱི་བ་དང་།
en: When they undertake training in order that all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas may be terminated, in order to become detached from them, in order that they may cease, and in order that they may not arise, do they train in all-aspect omniscience?

source: འདོད་ཆགས་དང་བྲལ་བར་བགྱི་བ་དང་འགག་པར་བགྱི་བ་དང་། མི་སྐྱེ་བར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བས་པར་བགྱི་བ་དང་། འདོད་ཆགས་དང་བྲལ་བར་བགྱི་བ་དང་།
en: When they undertake training in order that [the goals], up to and including all-aspect omniscience, may be terminated, in order to become detached from them, in order that they may cease and in order that they may not arise, do they train in all-aspect omniscience?” “

source: འགག་པར་བགྱི་བ་དང་། མི་སྐྱེ་བར་བགྱི་བའི་སླད་དུ་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ།
en: No, Subhūti!”

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ཏེ། གནས་བརྟན་རབ་འབྱོར་གྱིས་གང་འདི་སྐད་དུ། གཟུགས་ཟད་པར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: The elder Subhūti has asked, ‘When they undertake training in order that physical forms may be terminated, do they train in all-aspect omniscience?

source: གཟུགས་འདོད་ཆགས་དང་བྲལ་བར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order to become detached from physical forms, do they train in all-aspect omniscience?

source: གཟུགས་འགག་པར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order that physical forms may cease, do they train in all-aspect omniscience?

source: གཟུགས་མི་སྐྱེ་བར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order that physical forms may not arise, do they train in all-aspect omniscience?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཟད་པར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order that feelings, perceptions, formative predispositions, and consciousness may be terminated, do they train in all-aspect omniscience?

source: རྣམ་པར་ཤེས་པ་འདོད་ཆགས་དང་བྲལ་བར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order to become detached from consciousness [and so forth], do they train in all-aspect omniscience?

source: རྣམ་པར་ཤེས་པ་འགག་པར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order that consciousness [and so forth] may cease, do they train in all-aspect omniscience?

source: རྣམ་པར་ཤེས་པ་མི་སྐྱེ་བར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order that consciousness [and so forth] may not arise, do they train in all-aspect omniscience?

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟད་པར་བྱ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བར་བྱ་བ་དང་།
en: When they undertake training in order that the sense fields, the sensory elements, and the links of dependent origination may be terminated, in order to become detached from them, {Ki.

source: འགག་པར་བྱ་བ་དང་། མི་སྐྱེ་བར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: V: 29} in order that they may cease, and in order that they may not arise, do they train in all-aspect omniscience?

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཟད་པར་བྱ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བར་བྱ་བ་དང་།
en: When they undertake training in order that all the perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas may be terminated, in order to become detached from them, in order that they may cease, and in order that they may not arise, do they train in all-aspect omniscience?

source: འགག་པར་བྱ་བ་དང་། མི་སྐྱེ་བར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཟད་པར་བྱ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བར་བྱ་བ་དང་། འགག་པར་བྱ་བ་དང་། མི་སྐྱེ་བར་བྱ་བའི་ཕྱིར་སློབ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ཡིན་ནམ།
en: When they undertake training in order that [the goals], up to and including all-aspect omniscience, may be terminated, in order to become detached from them, in order that they may cease, and in order that they may not arise, do they train in all-aspect omniscience?’

source: ཞེས་སྨྲས་པ་དེ་ནི་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་།
en: That is not the case! “

source: སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། འཕགས་པའི་བདེན་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཟད་པ་འམ། སྤོང་བ་འམ། སྐྱེ་བ་འམ།
en: Subhūti, do you think that the real nature of physical forms; the real nature of feelings, perceptions, formative predispositions, and consciousness; the real nature of the sense fields, the sensory elements, and the links of dependent origination; the real nature of the perfections; the real nature of all the aspects of emptiness; the real nature of the thirty-seven factors conducive to enlightenment; the real nature of the truths of the noble ones; the real nature of the meditative concentrations, the immeasurable attitudes, and the formless absorptions; the real nature of the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness; the real nature of the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; the real nature of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas; and the real nature of [the goals], up to and including all-aspect omniscience, can be terminated, abandoned, or arise or cease?” “

source: འགག་པར་འགྱུར་རམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: No, Blessed Lord!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དེ་བཞིན་ཉིད་ལ་སློབ་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སློབ་པ་ཡིན། དེ་བཞིན་ཉིད་ནི་ཟད་པ་འམ། སྤང་བ་འམ། སྐྱེ་བ་འམ།
en: Subhūti,” continued the Blessed One, “those bodhisattva great beings who train accordingly train in the real nature, and they do train in all-aspect omniscience.

source: འགག་པར་འགྱུར་བ་མེད་དེ། རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དེ་བཞིན་ཉིད་ལ་སློབ་པ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སློབ་པ་ཡིན། རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སློབ་པ་ཡིན། སྟོང་པ་ཉིད་ཐམས་ཅད་ལ་སློབ་པ་ཡིན། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སློབ་པ་ཡིན། ཡང་དག་པར་སྤོང་པ་དང་།
en: Subhūti, those bodhisattva great beings who train accordingly train in six perfections, and they do train in all-aspect omniscience.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སློབ་པ་ཡིན།
en: They train in all the aspects of emptiness, they train in the four applications of mindfulness, and they train in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: འཕགས་པའི་བདེན་པ་རྣམས་ལ་སློབ་པ་ཡིན།
en: They train in the truths of the noble ones.

source: བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་སློབ་པ་ཡིན།
en: They train in the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་སློབ་པ་ཡིན།
en: They train in the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness.

source: མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་སློབ་པ་ཡིན།
en: They train in the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: They train in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, {Ki.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སློབ་པ་ཡིན།
en: V: 30} and the eighteen distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སློབ་པ་ཡིན།
en: They train in [the goals], up to and including all-aspect omniscience. “

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསླབ་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐོབ་པར་འགྱུར་བ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly will attain the perfection of all trainings.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བདུད་དམ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཕམ་པར་མི་ནུས་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly cannot succumb to Māra, or to the gods within the realm of Māra.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་ཕྱིར་མི་ལྡོག་པའི་ས་འཐོབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly will swiftly attain the level at which progress has become irreversible.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བདག་གི་ཕ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly will experience the perceptual range of their respective tathāgatas.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མགོན་དུ་འགྱུར་བའི་ཆོས་རྣམས་ལ་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in the protective Dharma.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in great loving kindness and great compassion.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in order to refine the buddhafields.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in order to bring beings to maturity. “

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་བཅུ་གཉིས་ལན་གསུམ་དུ་བསྐོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱ་བའི་ཕྱིར་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in order to turn the wheel of the Dharma in three times and twelve ways.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in order to bring all beings to maturity.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་བཞིན་གཤེགས་པའི་རིགས་རྒྱུན་མི་གཅད་པའི་ཕྱིར་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in order to ensure that the lineage of the tathāgatas will not be interrupted.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འཆི་བ་མེད་པའི་སྒོ་དབྱེ་བར་བྱའོ་ཞེས་སློབ་པ་ཡིན།
en: Subhūti, bodhisattva great beings who train accordingly train in order to open the portals of immortality.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདུས་བྱས་ཀྱི་ཁམས་བསྟན་པར་བྱའོ་ཞེས་སློབ་པ་ཡིན་ཏེ།
en: Subhūti, bodhisattva great beings who train accordingly train in order to reveal the unconditioned elements. “

source: རབ་འབྱོར་སེམས་ཅན་དམན་པས་ནི་བསླབ་པ་རྒྱ་ཆེན་པོ་འདི་ལ་བསླབ་པར་མི་ནུས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསླབ་པ་འདི་ལ་སློབ་པ་དེ་ནི། སེམས་ཅན་ཐམས་ཅད་འཁོར་བ་ལས་གདོན་པར་འདོད་པ་སྟེ།
en: Subhūti, inferior beings cannot undertake this training, but bodhisattva great beings who would undertake training do train in it, wishing to extricate all beings from cyclic existence.

source: རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་དམྱལ་བར་མི་སྐྱེའོ།
en: Subhūti, bodhisattva great beings who train accordingly will not be born among the denizens of the hells.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་མི་སྐྱེའོ།
en: They will not be born in the animal realm, or in the world of Yama.

source: །ཡུལ་མཐའ་འཁོབ་དང་། ཡུལ་གཅོང་རོང་ཅན་དུ་མི་སྐྱེའོ། །ཕྱག་དར་པ་དང་།
en: They will not be born in frontier regions or precipitous gorges.

source: གདོལ་པའི་རིགས་སུ་མི་སྐྱེའོ། །ཞར་བར་མི་འགྱུར་རོ།
en: They will not be born among refuse scavengers, or among outcastes.

source: །སྒུར་པོར་མི་འགྱུར་རོ། །ཞ་བོར་མི་འགྱུར་རོ། །ཡན་ལག་སྐྱོན་ཅན་དུ་མི་འགྱུར་རོ།
en: They will not be blind, hunchbacked, crippled, or mutilated.

source: །འོན་པར་མི་འགྱུར་རོ།
en: They will not be deaf.

source: །ལག་པ་མེད་པར་མི་འགྱུར་རོ།
en: They will not be armless.

source: །དབང་པོ་དང་མི་ལྡན་པར་མི་འགྱུར་ཏེ།
en: They will not be without the sense faculties.

source: དབང་པོ་ཡོངས་སུ་ཚང་ཞིང་།
en: Their sense faculties will be intact.

source: དབང་པོ་མ་ཚང་བར་མི་འགྱུར་རོ།
en: Their sense faculties will not be deficient.

source: །སྲོག་གཅོད་པར་མི་འགྱུར་རོ།
en: They will not kill living creatures.

source: །མ་བྱིན་པར་ལེན་པ་དང་།
en: They will not steal.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་དང་།
en: They will not commit sexual misconduct.

source: བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་ཅན་དང་།
en: They will not tell lies.

source: ཞེ་གཅོད་པ་སྨྲ་བ་དང་། ཚིག་ཀྱལ་པ་ཅན་དང་། ཆགས་སེམས་ཅན་དང་།
en: They will not slander, or indulge in verbal abuse or irresponsible chatter.

source: གནོད་སེམས་ཅན་དང་།
en: They will not have thoughts of covetousness or malice.

source: ལོག་པར་ལྟ་བར་མི་འགྱུར་རོ།
en: They will not resort to mistaken views.

source: །འཚོ་བ་ལོག་པས་འཚོ་བར་མི་འགྱུར་རོ།
en: They will not sustain themselves through wrong livelihood.

source: །ཡང་དག་པ་མ་ཡིན་པ་ཡོངས་སུ་འཛིན་པར་མི་འགྱུར་རོ།
en: They will not acquire anything that is inauthentic.

source: །ཚུལ་ཁྲིམས་ངན་པ་ཅན་དུ་མི་འགྱུར་རོ།
en: They will not resort to degenerate morality.

source: །ཚུལ་ཁྲིམས་ངན་པ་ཡོངས་སུ་འཛིན་པར་མི་འགྱུར་རོ།
en: They will not acquire degenerate morality.

source: །རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལྷ་ཚེ་རིངས་པོའི་ནང་དུ་མི་སྐྱེའོ།
en: Subhūti, bodhisattva great beings who train accordingly will not be born among the long-lived gods. “

source: ཐབས་མཁས་པ་དང་ལྡན་པས་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷ་ཚེ་རིངས་པོར་མི་སྐྱེ་བའི་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དེ་ལ་ཡོད་དེ།
en: V: 31} they are endowed with skill in means, so that such bodhisattva great beings possess the skill in means through which they will not be born among the long-lived gods.

source: དེ་ཡང་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ལ་ཐབས་མཁས་པ་བསྟན་པ་སྟེ།
en: If you ask why, it is because skill in means is revealed in this very perfection of wisdom.

source: ཐབས་མཁས་པ་དེ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསམ་གཏན་རྣམས་ལ་ཡང་སྙོམས་པར་འཇུག །
en: Bodhisattva great beings who possess skill in means will also become absorbed in the meditative concentrations.

source: ཚད་མེད་པ་རྣམས་ལ་ཡང་སྙོམས་པར་འཇུག །
en: They will also become absorbed in the immeasurable attitudes.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་ཡང་སྙོམས་པར་འཇུག་སྟེ། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་དབང་གིས་ཀྱང་མི་སྐྱེའོ།
en: They will also become absorbed in the formless absorptions, but they will not take rebirth [in the realms of form and formlessness] due to the influences of these meditative concentrations, immeasurable attitudes, and formless absorptions. “

source: །རབ་འབྱོར་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ཡིད་ལ་བྱ་བའི་དྲི་མ་ཡོངས་སུ་དག་པས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྟོབས་ཡོངས་སུ་དག་པ་ཐོབ་པར་འགྱུར་རོ། །གསོལ་པ།
en: Subhūti, bodhisattva great beings who train accordingly will purify the stains of directing their minds to the level of the śrāvakas and the level of the pratyekabuddhas, and so they will acquire refinement of the powers associated with all the attributes of the buddhas.” “

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོས་གང་གིས་ཡོངས་སུ་དག་པ་འཐོབ་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, inasmuch as all phenomena are naturally pure, what are the attributes of the bodhisattva great beings through which this refinement is acquired?” “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་སྟེ།
en: Subhūti, all phenomena are naturally pure.
